"""
Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные.
"""

a = 1
b = "string"
c = True
d = None
e = 1.1
f = [1, 2, 3]
g = (1, 2, 3)
h = {"a": 1, "b": 2}

print(type(a), type(b), type(c), type(d), type(e), type(f), type(g), type(h), sep="\n")
